spec/cassettes/BQBL_ResourceProxy/orders_resource/_find/supports_multiple_includes.json

{
  "http_interactions": [
    {
      "request": {
        "method": "get",
        "uri": "http://<BOOQABLE_COMPANY>.booqable.test/api/4/orders/3e037580-3d7a-4d23-876c-f0ba1a481bb7?include=customer,lines",
        "body": {
          "encoding": "US-ASCII",
          "string": ""
        },
        "headers": {
          "Accept": [
            "application/vnd.api+json"
          ],
          "Content-Type": [
            "application/vnd.api+json"
          ],
          "User-Agent": [
            "BQBL Ruby Gem 0.1.0"
          ],
          "Authorization": [
            "Bearer <BOOQABLE_API_KEY>"
          ],
          "Accept-Encoding": [
            "gzip;q=1.0,deflate;q=0.6,identity;q=0.3"
          ]
        }
      },
      "response": {
        "status": {
          "code": 200,
          "message": "OK"
        },
        "headers": {
          "Access-Control-Allow-Credentials": [
            "false"
          ],
          "Cache-Control": [
            "max-age=0, private, must-revalidate"
          ],
          "Client-Version": [
            "336d5ebc5436534e61d16e63ddfca327"
          ],
          "Content-Length": [
            "4537"
          ],
          "Content-Type": [
            "application/vnd.api+json; charset=utf-8"
          ],
          "Etag": [
            "W/\"caa20639be43e7146bc3605a543a463c\""
          ],
          "Referrer-Policy": [
            "strict-origin-when-cross-origin"
          ],
          "Server-Timing": [
            "sql.active_record;dur=13.14, instantiation.active_record;dur=1.09, start_processing.action_controller;dur=0.00, adapter_operation.flipper;dur=2.10, cache_read.active_support;dur=0.03, cache_write.active_support;dur=0.10, start_transaction.active_record;dur=0.00, transaction.active_record;dur=1.71, enqueue.active_job;dur=0.86, resolve.graphiti;dur=8.84, render.graphiti;dur=7.46, flush_debug.graphiti;dur=0.28, process_action.action_controller;dur=104.30"
          ],
          "Session-Expiry-Token": [
            "17b70851ea5e258b171eb7a337c50067"
          ],
          "Set-Cookie": [
            "<SESSION_COOKIE>"
          ],
          "Vary": [
            "Accept-Encoding, Origin"
          ],
          "X-Content-Type-Options": [
            "nosniff"
          ],
          "X-Frame-Options": [
            "SAMEORIGIN"
          ],
          "X-Permitted-Cross-Domain-Policies": [
            "none"
          ],
          "X-Ratelimit-Limit": [
            "50"
          ],
          "X-Ratelimit-Period": [
            "60"
          ],
          "X-Ratelimit-Remaining": [
            "34"
          ],
          "X-Request-Id": [
            "0dbf6a1e-2a95-4a88-b763-b6a03e6b159e"
          ],
          "X-Runtime": [
            "0.147565"
          ],
          "X-Xss-Protection": [
            "0"
          ],
          "Date": [
            "Wed, 09 Jul 2025 12:28:40 GMT"
          ]
        },
        "body": {
          "encoding": "ASCII-8BIT",
          "string": "{\"data\":{\"id\":\"3e037580-3d7a-4d23-876c-f0ba1a481bb7\",\"type\":\"orders\",\"attributes\":{\"created_at\":\"2025-06-26T15:14:02.919161+00:00\",\"updated_at\":\"2025-07-09T06:44:11.739596+00:00\",\"number\":200,\"status\":\"concept\",\"statuses\":[\"concept\"],\"status_counts\":{\"concept\":2,\"new\":0,\"reserved\":0,\"started\":0,\"stopped\":0},\"starts_at\":\"2025-04-09T11:00:00.000000+00:00\",\"stops_at\":\"2025-04-11T17:00:00.000000+00:00\",\"deposit_type\":\"percentage\",\"deposit_value\":100.0,\"entirely_started\":false,\"entirely_stopped\":false,\"location_shortage\":false,\"shortage\":false,\"payment_status\":\"payment_due\",\"override_period_restrictions\":false,\"has_signed_contract\":false,\"item_count\":2,\"tag_list\":[\"webshop\"],\"properties\":{\"delivery_address\":null,\"billing_address\":null},\"amount_in_cents\":162000,\"amount_paid_in_cents\":0,\"amount_to_be_paid_in_cents\":162000,\"deposit_in_cents\":0,\"deposit_held_in_cents\":0,\"deposit_paid_in_cents\":0,\"deposit_to_be_paid_in_cents\":0,\"deposit_refunded_in_cents\":0,\"deposit_to_refund_in_cents\":0,\"total_in_cents\":162000,\"total_paid_in_cents\":0,\"total_to_be_paid_in_cents\":162000,\"total_discount_in_cents\":0,\"coupon_discount_in_cents\":0,\"discount_in_cents\":0,\"grand_total_in_cents\":162000,\"grand_total_with_tax_in_cents\":162000,\"paid_in_cents\":0,\"price_in_cents\":162000,\"tax_in_cents\":0,\"to_be_paid_in_cents\":162000,\"discount_type\":\"percentage\",\"discount_percentage\":0.0,\"billing_address_property_id\":null,\"delivery_address_property_id\":null,\"fulfillment_type\":\"pickup\",\"delivery_address\":null,\"customer_id\":\"2f84548b-af55-41c4-a28e-0164c5739d5a\",\"tax_region_id\":null,\"coupon_id\":null,\"start_location_id\":\"0ddaa18d-a229-4cfd-a298-2020de1afdad\",\"stop_location_id\":\"0ddaa18d-a229-4cfd-a298-2020de1afdad\",\"order_delivery_rate_id\":null},\"relationships\":{\"customer\":{\"data\":{\"type\":\"customers\",\"id\":\"2f84548b-af55-41c4-a28e-0164c5739d5a\"}},\"lines\":{\"data\":[{\"type\":\"lines\",\"id\":\"5cabe2dc-212e-4e18-8ba8-ff91b83e318f\"},{\"type\":\"lines\",\"id\":\"ff4d1d2c-193e-491d-b9be-86d709a09cbc\"}]}}},\"included\":[{\"id\":\"2f84548b-af55-41c4-a28e-0164c5739d5a\",\"type\":\"customers\",\"attributes\":{\"created_at\":\"2025-04-01T13:26:17.461648+00:00\",\"updated_at\":\"2025-06-17T08:26:45.683937+00:00\",\"archived\":false,\"archived_at\":null,\"number\":34,\"name\":\"User Example\",\"email\":\"user@example.com\",\"deposit_type\":\"default\",\"deposit_value\":0.0,\"discount_percentage\":0.0,\"legal_type\":\"person\",\"email_marketing_consented\":false,\"email_marketing_consent_updated_at\":null,\"properties\":{\"main_address\":\"\"},\"tag_list\":[],\"stripe_id\":null,\"merge_suggestion_customer_id\":\"2bfd562e-e0b8-4121-9187-2b5bdfbd7922\",\"tax_region_id\":null},\"relationships\":{}},{\"id\":\"5cabe2dc-212e-4e18-8ba8-ff91b83e318f\",\"type\":\"lines\",\"attributes\":{\"created_at\":\"2025-07-09T06:44:10.148271+00:00\",\"updated_at\":\"2025-07-09T06:44:13.199761+00:00\",\"archived\":false,\"archived_at\":null,\"title\":\"Batavus female bike\",\"extra_information\":null,\"quantity\":1,\"original_price_each_in_cents\":81000,\"original_charge_length\":null,\"original_charge_label\":null,\"price_each_in_cents\":81000,\"price_in_cents\":81000,\"display_price_in_cents\":81000,\"position\":2,\"charge_label\":\"54 hours\",\"charge_length\":194400,\"price_rule_values\":null,\"discountable\":true,\"taxable\":true,\"line_type\":\"charge\",\"relevant\":true,\"order_id\":\"3e037580-3d7a-4d23-876c-f0ba1a481bb7\",\"item_id\":\"91f5ece2-84f9-4a25-996e-3dc635bca9de\",\"tax_category_id\":null,\"price_structure_id\":null,\"price_tile_id\":null,\"planning_id\":\"31480d6b-9871-40c8-9550-63046e461289\",\"parent_line_id\":null,\"owner_id\":\"3e037580-3d7a-4d23-876c-f0ba1a481bb7\",\"owner_type\":\"orders\"},\"relationships\":{}},{\"id\":\"ff4d1d2c-193e-491d-b9be-86d709a09cbc\",\"type\":\"lines\",\"attributes\":{\"created_at\":\"2025-07-09T06:44:11.355755+00:00\",\"updated_at\":\"2025-07-09T06:44:13.199761+00:00\",\"archived\":false,\"archived_at\":null,\"title\":\"Batavus male bike\",\"extra_information\":null,\"quantity\":1,\"original_price_each_in_cents\":81000,\"original_charge_length\":null,\"original_charge_label\":null,\"price_each_in_cents\":81000,\"price_in_cents\":81000,\"display_price_in_cents\":81000,\"position\":3,\"charge_label\":\"54 hours\",\"charge_length\":194400,\"price_rule_values\":null,\"discountable\":true,\"taxable\":true,\"line_type\":\"charge\",\"relevant\":true,\"order_id\":\"3e037580-3d7a-4d23-876c-f0ba1a481bb7\",\"item_id\":\"5eee62db-4dd1-453a-97b1-96717bae999b\",\"tax_category_id\":null,\"price_structure_id\":null,\"price_tile_id\":null,\"planning_id\":\"3695e388-b188-46b5-9ffb-01d37500976d\",\"parent_line_id\":null,\"owner_id\":\"3e037580-3d7a-4d23-876c-f0ba1a481bb7\",\"owner_type\":\"orders\"},\"relationships\":{}}],\"meta\":{}}"
        }
      },
      "recorded_at": "Wed, 09 Jul 2025 12:28:40 GMT"
    }
  ],
  "recorded_with": "VCR 6.3.1"
}
