spec/cassettes/BQBL_ResourceProxy/orders_resource/_list/returns_orders_with_expected_attributes.json

{
  "http_interactions": [
    {
      "request": {
        "method": "get",
        "uri": "http://<BOOQABLE_COMPANY>.booqable.test/api/4/orders?page%5Bnumber%5D=1&page%5Bsize%5D=25&stats%5Btotal%5D=count",
        "body": {
          "encoding": "US-ASCII",
          "string": ""
        },
        "headers": {
          "Accept": [
            "application/vnd.api+json"
          ],
          "Content-Type": [
            "application/vnd.api+json"
          ],
          "User-Agent": [
            "BQBL Ruby Gem 0.1.0"
          ],
          "Authorization": [
            "Bearer <BOOQABLE_API_KEY>"
          ],
          "Accept-Encoding": [
            "gzip;q=1.0,deflate;q=0.6,identity;q=0.3"
          ]
        }
      },
      "response": {
        "status": {
          "code": 200,
          "message": "OK"
        },
        "headers": {
          "Access-Control-Allow-Credentials": [
            "false"
          ],
          "Cache-Control": [
            "max-age=0, private, must-revalidate"
          ],
          "Client-Version": [
            "336d5ebc5436534e61d16e63ddfca327"
          ],
          "Content-Length": [
            "8586"
          ],
          "Content-Type": [
            "application/vnd.api+json; charset=utf-8"
          ],
          "Etag": [
            "W/\"7602179a748c67936fdbf3feb89373cf\""
          ],
          "Referrer-Policy": [
            "strict-origin-when-cross-origin"
          ],
          "Server-Timing": [
            "sql.active_record;dur=14.19, instantiation.active_record;dur=0.39, start_processing.action_controller;dur=0.00, adapter_operation.flipper;dur=1.02, cache_read.active_support;dur=0.02, cache_write.active_support;dur=0.11, start_transaction.active_record;dur=0.00, transaction.active_record;dur=3.13, enqueue.active_job;dur=1.69, resolve.graphiti;dur=4.58, render.graphiti;dur=5.32, flush_debug.graphiti;dur=0.18, process_action.action_controller;dur=101.15"
          ],
          "Session-Expiry-Token": [
            "17b70851ea5e258b171eb7a337c50067"
          ],
          "Set-Cookie": [
            "<SESSION_COOKIE>"
          ],
          "Vary": [
            "Accept-Encoding, Origin"
          ],
          "X-Content-Type-Options": [
            "nosniff"
          ],
          "X-Frame-Options": [
            "SAMEORIGIN"
          ],
          "X-Permitted-Cross-Domain-Policies": [
            "none"
          ],
          "X-Ratelimit-Limit": [
            "50"
          ],
          "X-Ratelimit-Period": [
            "60"
          ],
          "X-Ratelimit-Remaining": [
            "41"
          ],
          "X-Request-Id": [
            "b5954b19-add7-4c8c-97fd-bb8a44fa279d"
          ],
          "X-Runtime": [
            "0.151879"
          ],
          "X-Xss-Protection": [
            "0"
          ],
          "Date": [
            "Wed, 09 Jul 2025 12:28:39 GMT"
          ]
        },
        "body": {
          "encoding": "ASCII-8BIT",
          "string": "{\"data\":[{\"id\":\"c6d1bf6f-0446-4fb2-a642-eb8accd39406\",\"type\":\"orders\",\"attributes\":{\"created_at\":\"2025-07-09T09:22:00.952147+00:00\",\"updated_at\":\"2025-07-09T09:22:00.967258+00:00\",\"number\":202,\"status\":\"reserved\",\"statuses\":[\"reserved\"],\"status_counts\":{\"new\":0,\"concept\":0,\"reserved\":0,\"started\":0,\"stopped\":0},\"starts_at\":\"2024-01-01T00:00:00.000000+00:00\",\"stops_at\":\"2024-01-02T00:00:00.000000+00:00\",\"deposit_type\":\"percentage\",\"deposit_value\":100.0,\"entirely_started\":true,\"entirely_stopped\":false,\"location_shortage\":false,\"shortage\":false,\"payment_status\":\"paid\",\"override_period_restrictions\":false,\"has_signed_contract\":false,\"item_count\":0,\"tag_list\":[],\"properties\":{\"delivery_address\":null,\"billing_address\":null},\"amount_in_cents\":0,\"amount_paid_in_cents\":0,\"amount_to_be_paid_in_cents\":null,\"deposit_in_cents\":0,\"deposit_held_in_cents\":0,\"deposit_paid_in_cents\":0,\"deposit_to_be_paid_in_cents\":null,\"deposit_refunded_in_cents\":0,\"deposit_to_refund_in_cents\":0,\"total_in_cents\":0,\"total_paid_in_cents\":0,\"total_to_be_paid_in_cents\":0,\"total_discount_in_cents\":0,\"coupon_discount_in_cents\":0,\"discount_in_cents\":0,\"grand_total_in_cents\":0,\"grand_total_with_tax_in_cents\":0,\"paid_in_cents\":0,\"price_in_cents\":0,\"tax_in_cents\":0,\"to_be_paid_in_cents\":0,\"discount_type\":\"percentage\",\"discount_percentage\":0.0,\"billing_address_property_id\":null,\"delivery_address_property_id\":null,\"fulfillment_type\":\"pickup\",\"delivery_address\":null,\"customer_id\":null,\"tax_region_id\":null,\"coupon_id\":null,\"start_location_id\":\"0ddaa18d-a229-4cfd-a298-2020de1afdad\",\"stop_location_id\":\"0ddaa18d-a229-4cfd-a298-2020de1afdad\",\"order_delivery_rate_id\":null},\"relationships\":{}},{\"id\":\"7c4425f3-e3a0-467a-981c-ec21640c4419\",\"type\":\"orders\",\"attributes\":{\"created_at\":\"2025-07-09T09:21:49.108110+00:00\",\"updated_at\":\"2025-07-09T09:21:49.118961+00:00\",\"number\":201,\"status\":\"concept\",\"statuses\":[\"concept\"],\"status_counts\":{\"new\":0,\"concept\":0,\"reserved\":0,\"started\":0,\"stopped\":0},\"starts_at\":\"2024-01-01T00:00:00.000000+00:00\",\"stops_at\":\"2024-01-02T00:00:00.000000+00:00\",\"deposit_type\":\"percentage\",\"deposit_value\":100.0,\"entirely_started\":true,\"entirely_stopped\":false,\"location_shortage\":false,\"shortage\":false,\"payment_status\":\"paid\",\"override_period_restrictions\":false,\"has_signed_contract\":false,\"item_count\":0,\"tag_list\":[],\"properties\":{\"delivery_address\":null,\"billing_address\":null},\"amount_in_cents\":0,\"amount_paid_in_cents\":0,\"amount_to_be_paid_in_cents\":null,\"deposit_in_cents\":0,\"deposit_held_in_cents\":0,\"deposit_paid_in_cents\":0,\"deposit_to_be_paid_in_cents\":null,\"deposit_refunded_in_cents\":0,\"deposit_to_refund_in_cents\":0,\"total_in_cents\":0,\"total_paid_in_cents\":0,\"total_to_be_paid_in_cents\":0,\"total_discount_in_cents\":0,\"coupon_discount_in_cents\":0,\"discount_in_cents\":0,\"grand_total_in_cents\":0,\"grand_total_with_tax_in_cents\":0,\"paid_in_cents\":0,\"price_in_cents\":0,\"tax_in_cents\":0,\"to_be_paid_in_cents\":0,\"discount_type\":\"percentage\",\"discount_percentage\":0.0,\"billing_address_property_id\":null,\"delivery_address_property_id\":null,\"fulfillment_type\":\"pickup\",\"delivery_address\":null,\"customer_id\":null,\"tax_region_id\":null,\"coupon_id\":null,\"start_location_id\":\"0ddaa18d-a229-4cfd-a298-2020de1afdad\",\"stop_location_id\":\"0ddaa18d-a229-4cfd-a298-2020de1afdad\",\"order_delivery_rate_id\":null},\"relationships\":{}},{\"id\":\"3e037580-3d7a-4d23-876c-f0ba1a481bb7\",\"type\":\"orders\",\"attributes\":{\"created_at\":\"2025-06-26T15:14:02.919161+00:00\",\"updated_at\":\"2025-07-09T06:44:11.739596+00:00\",\"number\":200,\"status\":\"concept\",\"statuses\":[\"concept\"],\"status_counts\":{\"concept\":2,\"new\":0,\"reserved\":0,\"started\":0,\"stopped\":0},\"starts_at\":\"2025-04-09T11:00:00.000000+00:00\",\"stops_at\":\"2025-04-11T17:00:00.000000+00:00\",\"deposit_type\":\"percentage\",\"deposit_value\":100.0,\"entirely_started\":false,\"entirely_stopped\":false,\"location_shortage\":false,\"shortage\":false,\"payment_status\":\"payment_due\",\"override_period_restrictions\":false,\"has_signed_contract\":false,\"item_count\":2,\"tag_list\":[\"webshop\"],\"properties\":{\"delivery_address\":null,\"billing_address\":null},\"amount_in_cents\":162000,\"amount_paid_in_cents\":0,\"amount_to_be_paid_in_cents\":162000,\"deposit_in_cents\":0,\"deposit_held_in_cents\":0,\"deposit_paid_in_cents\":0,\"deposit_to_be_paid_in_cents\":0,\"deposit_refunded_in_cents\":0,\"deposit_to_refund_in_cents\":0,\"total_in_cents\":162000,\"total_paid_in_cents\":0,\"total_to_be_paid_in_cents\":162000,\"total_discount_in_cents\":0,\"coupon_discount_in_cents\":0,\"discount_in_cents\":0,\"grand_total_in_cents\":162000,\"grand_total_with_tax_in_cents\":162000,\"paid_in_cents\":0,\"price_in_cents\":162000,\"tax_in_cents\":0,\"to_be_paid_in_cents\":162000,\"discount_type\":\"percentage\",\"discount_percentage\":0.0,\"billing_address_property_id\":null,\"delivery_address_property_id\":null,\"fulfillment_type\":\"pickup\",\"delivery_address\":null,\"customer_id\":\"2f84548b-af55-41c4-a28e-0164c5739d5a\",\"tax_region_id\":null,\"coupon_id\":null,\"start_location_id\":\"0ddaa18d-a229-4cfd-a298-2020de1afdad\",\"stop_location_id\":\"0ddaa18d-a229-4cfd-a298-2020de1afdad\",\"order_delivery_rate_id\":null},\"relationships\":{}},{\"id\":\"ef67861b-335d-4cc8-9a88-7025f904de39\",\"type\":\"orders\",\"attributes\":{\"created_at\":\"2025-06-26T14:52:26.996945+00:00\",\"updated_at\":\"2025-06-26T14:52:27.086304+00:00\",\"number\":199,\"status\":\"concept\",\"statuses\":[\"concept\"],\"status_counts\":{\"new\":0,\"concept\":1,\"reserved\":0,\"started\":0,\"stopped\":0},\"starts_at\":\"2025-04-09T09:00:00.000000+00:00\",\"stops_at\":\"2025-04-11T15:00:00.000000+00:00\",\"deposit_type\":\"percentage\",\"deposit_value\":100.0,\"entirely_started\":false,\"entirely_stopped\":false,\"location_shortage\":false,\"shortage\":false,\"payment_status\":\"payment_due\",\"override_period_restrictions\":false,\"has_signed_contract\":false,\"item_count\":1,\"tag_list\":[\"webshop\"],\"properties\":{\"delivery_address\":null,\"billing_address\":null},\"amount_in_cents\":270000,\"amount_paid_in_cents\":0,\"amount_to_be_paid_in_cents\":270000,\"deposit_in_cents\":0,\"deposit_held_in_cents\":0,\"deposit_paid_in_cents\":0,\"deposit_to_be_paid_in_cents\":0,\"deposit_refunded_in_cents\":0,\"deposit_to_refund_in_cents\":0,\"total_in_cents\":270000,\"total_paid_in_cents\":0,\"total_to_be_paid_in_cents\":270000,\"total_discount_in_cents\":0,\"coupon_discount_in_cents\":0,\"discount_in_cents\":0,\"grand_total_in_cents\":270000,\"grand_total_with_tax_in_cents\":270000,\"paid_in_cents\":0,\"price_in_cents\":270000,\"tax_in_cents\":0,\"to_be_paid_in_cents\":270000,\"discount_type\":\"percentage\",\"discount_percentage\":0.0,\"billing_address_property_id\":null,\"delivery_address_property_id\":null,\"fulfillment_type\":\"pickup\",\"delivery_address\":null,\"customer_id\":\"2f84548b-af55-41c4-a28e-0164c5739d5a\",\"tax_region_id\":null,\"coupon_id\":null,\"start_location_id\":\"0ddaa18d-a229-4cfd-a298-2020de1afdad\",\"stop_location_id\":\"0ddaa18d-a229-4cfd-a298-2020de1afdad\",\"order_delivery_rate_id\":null},\"relationships\":{}},{\"id\":\"2e444fef-7d86-44dd-a280-9b1d2347121d\",\"type\":\"orders\",\"attributes\":{\"created_at\":\"2025-06-26T14:51:47.251488+00:00\",\"updated_at\":\"2025-06-26T14:51:47.278782+00:00\",\"number\":198,\"status\":\"concept\",\"statuses\":[\"concept\"],\"status_counts\":{\"new\":0,\"concept\":1,\"reserved\":0,\"started\":0,\"stopped\":0},\"starts_at\":\"2025-04-09T09:00:00.000000+00:00\",\"stops_at\":\"2025-04-11T15:00:00.000000+00:00\",\"deposit_type\":\"percentage\",\"deposit_value\":100.0,\"entirely_started\":false,\"entirely_stopped\":false,\"location_shortage\":false,\"shortage\":false,\"payment_status\":\"payment_due\",\"override_period_restrictions\":false,\"has_signed_contract\":false,\"item_count\":1,\"tag_list\":[\"webshop\"],\"properties\":{\"delivery_address\":null,\"billing_address\":null},\"amount_in_cents\":270000,\"amount_paid_in_cents\":0,\"amount_to_be_paid_in_cents\":270000,\"deposit_in_cents\":0,\"deposit_held_in_cents\":0,\"deposit_paid_in_cents\":0,\"deposit_to_be_paid_in_cents\":0,\"deposit_refunded_in_cents\":0,\"deposit_to_refund_in_cents\":0,\"total_in_cents\":270000,\"total_paid_in_cents\":0,\"total_to_be_paid_in_cents\":270000,\"total_discount_in_cents\":0,\"coupon_discount_in_cents\":0,\"discount_in_cents\":0,\"grand_total_in_cents\":270000,\"grand_total_with_tax_in_cents\":270000,\"paid_in_cents\":0,\"price_in_cents\":270000,\"tax_in_cents\":0,\"to_be_paid_in_cents\":270000,\"discount_type\":\"percentage\",\"discount_percentage\":0.0,\"billing_address_property_id\":null,\"delivery_address_property_id\":null,\"fulfillment_type\":\"pickup\",\"delivery_address\":null,\"customer_id\":\"2f84548b-af55-41c4-a28e-0164c5739d5a\",\"tax_region_id\":null,\"coupon_id\":null,\"start_location_id\":\"0ddaa18d-a229-4cfd-a298-2020de1afdad\",\"stop_location_id\":\"0ddaa18d-a229-4cfd-a298-2020de1afdad\",\"order_delivery_rate_id\":null},\"relationships\":{}}],\"meta\":{\"stats\":{\"total\":{\"count\":5}}}}"
        }
      },
      "recorded_at": "Wed, 09 Jul 2025 12:28:39 GMT"
    }
  ],
  "recorded_with": "VCR 6.3.1"
}