spec/cassettes/BQBL_ResourceProxy/orders_resource/includes_functionality/supports_including_customer_in_list.json

{
  "http_interactions": [
    {
      "request": {
        "method": "get",
        "uri": "http://<BOOQABLE_COMPANY>.booqable.test/api/4/orders?include=customer&page%5Bnumber%5D=1&page%5Bsize%5D=1&stats%5Btotal%5D=count",
        "body": {
          "encoding": "US-ASCII",
          "string": ""
        },
        "headers": {
          "Accept": [
            "application/vnd.api+json"
          ],
          "Content-Type": [
            "application/vnd.api+json"
          ],
          "User-Agent": [
            "BQBL Ruby Gem 0.1.0"
          ],
          "Authorization": [
            "Bearer <BOOQABLE_API_KEY>"
          ],
          "Accept-Encoding": [
            "gzip;q=1.0,deflate;q=0.6,identity;q=0.3"
          ]
        }
      },
      "response": {
        "status": {
          "code": 200,
          "message": "OK"
        },
        "headers": {
          "Access-Control-Allow-Credentials": [
            "false"
          ],
          "Cache-Control": [
            "max-age=0, private, must-revalidate"
          ],
          "Client-Version": [
            "336d5ebc5436534e61d16e63ddfca327"
          ],
          "Content-Length": [
            "2533"
          ],
          "Content-Type": [
            "application/vnd.api+json; charset=utf-8"
          ],
          "Etag": [
            "W/\"41cccbd3f2dae8dea9468364253f5ea0\""
          ],
          "Referrer-Policy": [
            "strict-origin-when-cross-origin"
          ],
          "Server-Timing": [
            "sql.active_record;dur=17.50, instantiation.active_record;dur=0.55, start_processing.action_controller;dur=0.00, adapter_operation.flipper;dur=1.97, cache_read.active_support;dur=0.03, cache_write.active_support;dur=0.13, start_transaction.active_record;dur=0.00, transaction.active_record;dur=2.35, enqueue.active_job;dur=2.10, resolve.graphiti;dur=6.49, render.graphiti;dur=8.57, flush_debug.graphiti;dur=0.23, process_action.action_controller;dur=103.04"
          ],
          "Vary": [
            "Accept-Encoding, Origin"
          ],
          "X-Content-Type-Options": [
            "nosniff"
          ],
          "X-Frame-Options": [
            "SAMEORIGIN"
          ],
          "X-Permitted-Cross-Domain-Policies": [
            "none"
          ],
          "X-Ratelimit-Limit": [
            "50"
          ],
          "X-Ratelimit-Period": [
            "60"
          ],
          "X-Ratelimit-Remaining": [
            "44"
          ],
          "X-Request-Id": [
            "ddf7127e-6306-477e-8a69-6ee42e36517f"
          ],
          "X-Runtime": [
            "0.144704"
          ],
          "X-Xss-Protection": [
            "0"
          ],
          "Date": [
            "Wed, 09 Jul 2025 06:33:50 GMT"
          ]
        },
        "body": {
          "encoding": "ASCII-8BIT",
          "string": "{\"data\":[{\"id\":\"3e037580-3d7a-4d23-876c-f0ba1a481bb7\",\"type\":\"orders\",\"attributes\":{\"created_at\":\"2025-06-26T15:14:02.919161+00:00\",\"updated_at\":\"2025-07-09T06:25:40.265989+00:00\",\"number\":200,\"status\":\"concept\",\"statuses\":[\"concept\"],\"status_counts\":{\"new\":0,\"concept\":1,\"reserved\":0,\"started\":0,\"stopped\":0},\"starts_at\":\"2025-04-09T11:00:00.000000+00:00\",\"stops_at\":\"2025-04-11T17:00:00.000000+00:00\",\"deposit_type\":\"percentage\",\"deposit_value\":100.0,\"entirely_started\":false,\"entirely_stopped\":false,\"location_shortage\":false,\"shortage\":false,\"payment_status\":\"payment_due\",\"override_period_restrictions\":false,\"has_signed_contract\":false,\"item_count\":1,\"tag_list\":[\"webshop\"],\"properties\":{\"delivery_address\":null,\"billing_address\":null},\"amount_in_cents\":270000,\"amount_paid_in_cents\":0,\"amount_to_be_paid_in_cents\":270000,\"deposit_in_cents\":0,\"deposit_held_in_cents\":0,\"deposit_paid_in_cents\":0,\"deposit_to_be_paid_in_cents\":0,\"deposit_refunded_in_cents\":0,\"deposit_to_refund_in_cents\":0,\"total_in_cents\":270000,\"total_paid_in_cents\":0,\"total_to_be_paid_in_cents\":270000,\"total_discount_in_cents\":0,\"coupon_discount_in_cents\":0,\"discount_in_cents\":0,\"grand_total_in_cents\":270000,\"grand_total_with_tax_in_cents\":270000,\"paid_in_cents\":0,\"price_in_cents\":270000,\"tax_in_cents\":0,\"to_be_paid_in_cents\":270000,\"discount_type\":\"percentage\",\"discount_percentage\":0.0,\"billing_address_property_id\":null,\"delivery_address_property_id\":null,\"fulfillment_type\":\"pickup\",\"delivery_address\":null,\"customer_id\":\"2f84548b-af55-41c4-a28e-0164c5739d5a\",\"tax_region_id\":null,\"coupon_id\":null,\"start_location_id\":\"0ddaa18d-a229-4cfd-a298-2020de1afdad\",\"stop_location_id\":\"0ddaa18d-a229-4cfd-a298-2020de1afdad\",\"order_delivery_rate_id\":null},\"relationships\":{\"customer\":{\"data\":{\"type\":\"customers\",\"id\":\"2f84548b-af55-41c4-a28e-0164c5739d5a\"}}}}],\"included\":[{\"id\":\"2f84548b-af55-41c4-a28e-0164c5739d5a\",\"type\":\"customers\",\"attributes\":{\"created_at\":\"2025-04-01T13:26:17.461648+00:00\",\"updated_at\":\"2025-06-17T08:26:45.683937+00:00\",\"archived\":false,\"archived_at\":null,\"number\":34,\"name\":\"User Example\",\"email\":\"user@example.com\",\"deposit_type\":\"default\",\"deposit_value\":0.0,\"discount_percentage\":0.0,\"legal_type\":\"person\",\"email_marketing_consented\":false,\"email_marketing_consent_updated_at\":null,\"properties\":{\"main_address\":\"***REMOVED*** 1\\n10000 ***REMOVED***\\n***REMOVED***\"},\"tag_list\":[],\"stripe_id\":null,\"merge_suggestion_customer_id\":\"2bfd562e-e0b8-4121-9187-2b5bdfbd7922\",\"tax_region_id\":null},\"relationships\":{}}],\"meta\":{\"stats\":{\"total\":{\"count\":3}}}}"
        }
      },
      "recorded_at": "Wed, 09 Jul 2025 06:33:50 GMT"
    }
  ],
  "recorded_with": "VCR 6.3.1"
}
